package main

func getTitle() string {
	return Title
}

const Title string = "Le temps des cerises" // 楽曲名
// var Song_BPM float64 = 72.0                 // 楽曲のテンポ
var Song_BPM float64 = 72.0 // 楽曲のテンポ

var Repetitions int = 3 // 繰返しの回数,0と定義すると、無限ループになり、永久に演奏を繰り返す。

// TITLE:Le temps des cerises
// タイトル:さくらんぼの実る頃
// 作詞：ジャン=バチスト・クレマン
// 作曲：アントワーヌ・ルナール
// 『Le Temps des Cerises』の歌詞は、フランスの銅工職人で共産主義者でもあった
// ジャン=バチスト・クレマン（Jean-Baptiste Clement、1836～1903）が、1866年に書いたもの
// 日本では、宮崎駿氏監督のアニメーション映画『紅の豚』（1992年）の序盤で、酒場の歌姫ジーナが歌う歌曲として使われ、
// 幅広い知名度を獲得しました。なお、ジーナの声優は、シャンソン歌手の加藤登紀子さんが務め、フランス語で歌っています。

// 楽譜データ
var Notes = []Note{
	{C4, L8},
	{F4, L8},
	{F4, L8},
	{F4, L8},
	{F4, L4 - L32d}, //48, 40,
	{R, L32d},
	{F4, L8},
	{G4, L8},

	{G4, L8},
	{G4, L8},
	{G4, L4 - L32d}, //48, 40,
	{R, L32d},
	{G4, L8},
	{A4, L8},
	{A4, L8},
	{A4, L8},
	{A4, L4 - L32d}, //48, 40,
	{R, L32d},
	{A4, L8},
	{AS4, L8},
	{AS4, L8},
	{AS4, L8},
	{AS4, L4 - L32d}, //48, 40,
	{R, L32d},

	{AS4, L8},
	{A4, L8},
	{A4, L8},
	{AS4, L8},
	{A4, L4d},        //  72, 72,
	{G4, L4d - L32d}, //72, 64,
	{R, L32d},
	{F4, L4 - L32d}, //48, 40,
	{R, L32d},

	{F4, L8},
	{AS4, L8},
	{AS4, L8},
	{AS4, L8},

	{AS4, L4 - L32d}, //48, 40,
	{R, L32d},
	{AS4, L8},
	{AS4, L8},
	{D5, L8},
	{AS4, L8},
	{AS4, L8},
	{A4, L8},

	{A4, L8},
	{A4, L8},
	{A4, L8},
	{A4, L8},
	{C5, L4 - L32d}, //48, 40,
	{R, L32d},
	{A4, L8},
	{A4, L8},

	{G4, L8},
	{F4, L8},
	{G4, L1 - L32d}, // 192,184,
	{R, L32d},

	{C4, L8},
	{F4, L8},
	{F4, L8},
	{F4, L8},
	{F4, L4 - L32d}, //48, 40,
	{R, L32d},

	{F4, L8},
	{G4, L8},
	{G4, L8},
	{G4, L8},
	{G4, L4 - L32d}, //48, 40,
	{R, L32d},
	{G4, L8},
	{A4, L8},
	{A4, L8},
	{A4, L8},
	{C5, L4 - L32d}, //48, 40,
	{R, L32d},
	{A4, L8},
	{A4, L8},
	{G4, L8},
	{F4, L8},
	{F4, L1}, // 184,184
	{R, L1},
}
